In [2]:
people = {
    "first": ["Corey", 'Jane', 'John'],
    "last": ["Schafer", 'Doe', 'Doe'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [13]:
# using the assignment operator
# it's like with this method when you want to change the names of all the column names.
# so here we have changed the column names of 'first' and 'last' to 'first_name' and 'last_name'.

df.columns = ['first_name', 'last name', 'email']

In [14]:
df

  first_name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [15]:
# now let's say you want to change the column names to upper-case or lower-case.
# we cann achieve that using the below code:

# this is a one liner syntax of for loop in python.
# its's simple to understand
# for every column of our dataframe.
# we will apply the upper() method to each of the column.
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [18]:
# in the above output you can notice that the column 'LAST NAME'
# it has spaces and in general having spaces is not a good syntax.
# so we can replace the spaces with something to make it a one unit.

# so here we have used a method from string class which contains the replace() method
# in this method we can specify what should be replaced and with what you want to replace
# so we have replaced ' ' space with '_' underscore.
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [20]:
# let's change the column names to lower case
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [21]:
# the second approach to changing the column names is by creating a dictionary.
# and use a rename() method, so we can pass column names to be renamed.

# The approach that we have ued above was used when we want to make changes to the original dataframe.


# This approach is to First see how the dataframe would look like if we make changes.
# so when we run this we won't see changes in the original dataframe.
# we will have to mention 'inplace=True' to make changes in our dataframe.
# it's like we made changes and we found that yes the changes are necesaary and they should remain in the dataframe.
# so you make inplace = True.
# to keep the changes.
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace = True)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [24]:
# NOW WE WILL LOOK AT How to change the data from different rows.
# we can access the data using the 'loc' attribute.

# this is achieved using the assignment operator

# but in this approach we have limited number of columns and we have applied this to the column 'first' which has no changes.
# what if there are 100+ rows. are we going to write all the things. NO!
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [26]:
# we can mention the row and column in a list and make changes to that specific part

# here we have accessed the 'last' and 'email' column of the 2nd row
# and we assigned the names  in a list, of what we want in those cells.
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [27]:
# if you want to change just one thing we can actively mention the row and column to the loc attribute
df.loc[2, 'last'] = 'Smith'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [29]:
# we can use the 'at' attribute here of our dataframe and make changes the similar way
df.at[2, 'last'] = 'Doe'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com